Autodesk.Revit.DB.Structure.LoadCase.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new LoadCase.
Remarks:
This method is designed to create LoadCase that is associated with user defined category.
document:
The Document to which new load case element will be added.
name:
The name of the load case.
natureId:
The load nature ID.
subcategoryId:
The load case subcategory ID. Could be one of predefined or user defined load case category.
Built-in structural Load Cases (Autodesk.Revit.DB.BuiltInCategory.OST_LoadCases) subcategories are:
Autodesk.Revit.DB.BuiltInCategory.OST_LoadCasesDeadAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesLiveAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesWindAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesSnowAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesRoofLiveAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesAccidentalAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesTemperatureAutodesk.Revit.DB.BuiltInCategory.OST_LoadCasesSeismic
Returns:
The newly created load case element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given name is not unique.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.LoadCase.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.LoadCaseCategory)
Creates a new LoadCase.
Remarks:
This method is designed to create LoadCase that is associated with one of the predefined category.
document:
The Document to which new load case element will be added.
name:
The name of the load case.
natureId:
The load nature ID.
loadCaseCategory:
The predefined load case category.
Returns:
The newly created load case element if successful, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given name is not unique.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016